foamCases/quadMesh/teste2/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1812                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     1812;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     myrhoCentralFoam;//rhoPimpleFoam;

startFrom       latestTime;//latestTime;

startTime       0;

stopAt          endTime;

endTime         2;

deltaT          2.5e-5;

writeControl    adjustableRunTime;

writeInterval   0.01;

purgeWrite      0;//200;

writeFormat     binary;

writePrecision  10;

writeCompression off;//on;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  false;

maxCo           0.3;

maxDeltaT       1e-5;

functions
{
 #include "probes"
 #include "average"
// #include "probesTimeFlow10"
}

// ************************************************************************* //
